app/Http/Controllers/Controller.php

    public function front_before_login_layout($title, $page_name, $data)
    {
        $data['generalSetting']             = GeneralSetting::find('1');
        $data['scrollNotice']               = ScrollNotice::find('1');
        $data['title']                      = $title.' :: '.$data['generalSetting']->site_name;
        $data['page_header']                = $title;
        $data['parentCats']                 = NewsCategory::select('id', 'sub_category', 'slug')->where('status', '=', 1)->where('parent_category', '=', 0)->get();
---
select * from `general_settings` where `general_settings`.`id` = '1' limit 1
select * from `scroll_notice` where `scroll_notice`.`id` = '1' limit 1
select `id`, `sub_category`, `slug` from `news_category` where `status` = 1 and `parent_category` = 0

    public function front_after_login_layout($title, $page_name, $data)
    {
        $data['generalSetting']     = GeneralSetting::find('1');
        $data['content']            = HomePage::where('status', '=', 1)->orderBy('id', 'ASC')->first();
        $data['title']              = $title.' :: '.$data['generalSetting']->site_name;
        $data['page_header']        = $title;
        $user_id                    = session('user_id');
        $data['user']               = User::find($user_id);
        $data['parentCats']         = NewsCategory::select('id', 'sub_category', 'slug')->where('status', '=', 1)->where('parent_category', '=', 0)->get();
---
select * from `general_settings` where `general_settings`.`id` = '1' limit 1
select * from `users` where `users`.`id` = 5 limit 1
select `id`, `sub_category`, `slug` from `news_category` where `status` = 1 and `parent_category` = 0

    public function admin_before_login_layout($title, $page_name, $data)
    {
        $data['generalSetting']     = GeneralSetting::find('1');
---
select * from `general_settings` where `general_settings`.`id` = '1' limit 1

    public function admin_after_login_layout($title, $page_name, $data)
    {
        // Helper::pr(session()->all());
        $data['generalSetting']     = GeneralSetting::find('1');
        $data['title']              = $title.' :: '.$data['generalSetting']->site_name;
        $data['page_header']        = $title;
        $user_id                    = session('user_id');
        $data['admin']              = Admin::find($user_id);
---
select * from `general_settings` where `general_settings`.`id` = '1' limit 1
select * from `admins` where `admins`.`id` = 1 limit 1