app/Http/Controllers/FrontController.php

select * from `general_settings` where `general_settings`.`id` = '1' limit 1
---
        public function submitNewArticle(Request $request)
        {
            $user_id                        = session('user_id');
            $data['user']                   = User::find($user_id);
            $data['articles']               = Article::where('user_id', '=', $user_id)->get();
             /* generate inspection pdf & save it to directory */
             $article_no = '';
             $fields = [];
             $generalSetting                 = GeneralSetting::find('1');