app/Http/Controllers/FrontController.php

    public function pageContent($slug)
    {
        $data['row']                    = Page::select('page_name', 'page_content')->where('status', '=', 1)->where('page_slug', '=', $slug)->first();
---
select `page_name`, `page_content` from `pages` where `status` = 1 and `page_slug` = 'submissions' limit 1

    public function newsContent($slug)
    {
        $data['rowContent']         = NewsContent::join('news_category', 'news_contents.sub_category', '=', 'news_category.id')
                                           ->select('news_contents.id as news_id', 'news_contents.*', 'news_category.sub_category as sub_category_name', 'news_category.slug as sub_category_slug')
                                           ->where('news_contents.status', '=', 1)
                                           ->where('news_contents.slug', '=', $slug)
                                           ->first();
        // Helper::pr($data['rowContent']);
        $author_name                = (($data['rowContent'])?$data['rowContent']->author_name:'');
        $parent_category_id         = (($data['rowContent'])?$data['rowContent']->parent_category:'');
        $data['authorPostCount']    = NewsContent::where('news_contents.status', '=', 1)
                                           ->where('news_contents.author_name', 'LIKE', '%'.$author_name.'%')
                                           ->count();
        $data['alsoLikeContents']   = NewsContent::join('news_category', 'news_contents.sub_category', '=', 'news_category.id')
                                           ->select('news_contents.id as news_id', 'news_contents.*', 'news_category.sub_category as sub_category_name', 'news_category.slug as sub_category_slug')
                                           ->where('news_contents.status', '=', 1)
                                           ->where('news_contents.parent_category', '=', $parent_category_id)
                                           ->where('news_contents.id', '!=', (($data['rowContent'])?$data['rowContent']->news_id:''))
                                           ->get();
---
select `news_contents`.`id` as `news_id`, `news_contents`.*, `news_category`.`sub_category` as `sub_category_name`, `news_category`.`slug` as `sub_category_slug` from `news_contents` inner join `news_category` on `news_contents`.`sub_category` = `news_category`.`id` where `news_contents`.`status` = 1 and `news_contents`.`slug` = 'neque-id-cursus-faucibus-tortor-neque-egestas15' limit 1
select count(*) as aggregate from `news_contents` where `news_contents`.`status` = 1 and `news_contents`.`author_name` LIKE '%Koushik%'
select `news_contents`.`id` as `news_id`, `news_contents`.*, `news_category`.`sub_category` as `sub_category_name`, `news_category`.`slug` as `sub_category_slug` from `news_contents` inner join `news_category` on `news_contents`.`sub_category` = `news_category`.`id` where `news_contents`.`status` = 1 and `news_contents`.`parent_category` = 9 and `news_contents`.`id` != 16

                                'activity_details'  => 'Sign In Success !!!',
                                'platform_type'     => 'WEB',
                            ];
                            UserActivity::insert($activityData);
---
insert into `user_activities` (`user_email`, `user_name`, `user_type`, `ip_address`, `activity_type`, `activity_details`, `platform_type`) values ('subhomoy@keylines.net', '', 'USER', '::1', 1, 'Sign In Success !!!', 'WEB')

        public function signUp(Request $request)
        {
            $data['countries']              = Country::select('id', 'name')->where('status', '=', 1)->get();
---
select `id`, `name` from `countries` where `status` = 1

        public function signout(Request $request){
            $user_email                             = $request->session()->get('email');
            $user_name                              = $request->session()->get('name');
            /* user activity */
                $activityData = [
                    'user_email'        => $user_email,
                    'user_name'         => $user_name,
                    'user_type'         => 'USER',
                    'ip_address'        => $request->ip(),
                    'activity_type'     => 2,
                    'activity_details'  => 'You Are Successfully Sign Out !!!',
                    'platform_type'     => 'WEB',
                ];
                UserActivity::insert($activityData);
---
insert into `user_activities` (`user_email`, `user_name`, `user_type`, `ip_address`, `activity_type`, `activity_details`, `platform_type`) values ('subhomoy@keylines.net', 'Subhomoy Samanta', 'USER', '::1', 2, 'You Are Successfully Sign Out !!!', 'WEB')

        public function dashboard()
        {
            $user_id                        = session('user_id');
            $data['user']                   = User::find($user_id);
            $data['approved_articles']      = Article::where('is_published', '=', 1)->where('user_id', '=', $user_id)->count();
---
select * from `users` where `users`.`id` = 5 limit 1
select count(*) as aggregate from `articles` where `is_published` = 0 and `user_id` = 5

        public function myProfile(Request $request)
        {
            $user_id                        = session('user_id');
            $data['user']                   = User::find($user_id);
            $data['countries']              = Country::select('id', 'name')->where('status', '=', 1)->get();
---
select * from `users` where `users`.`id` = 5 limit 1
select `id`, `name` from `countries` where `status` = 1

        public function changePassword(Request $request)
        {
            $user_id                        = session('user_id');
            $data['user']                   = User::find($user_id);
---
select * from `users` where `users`.`id` = 5 limit 1

        public function myArticle(Request $request)
        {
            $user_id                        = session('user_id');
            $data['user']                   = User::find($user_id);
            $data['articles']               = Article::where('user_id', '=', $user_id)->orderBy('id', 'DESC')->get();
---
select * from `users` where `users`.`id` = 5 limit 1
select * from `articles` where `user_id` = 5 order by `id` desc

        public function submitNewArticle(Request $request)
        {
            $user_id                        = session('user_id');
            $data['user']                   = User::find($user_id);
            $data['articles']               = Article::where('user_id', '=', $user_id)->get();
---
select * from `users` where `users`.`id` = 5 limit 1
select * from `articles` where `user_id` = 5

                        $currentMonth   = date('m');
                        $currentYear    = date('Y');
                        $currentMonthYear = $currentYear.'-'.$currentMonth;
                        $getLastArticle = Article::where('created_at', 'LIKE', '%'.$currentMonthYear.'%')->orderBy('id', 'DESC')->first();
---
select * from `articles` where `created_at` LIKE '%2024-09%' order by `id` desc limit 1


            $title                          = 'Submit New Creative-Work';
            $page_name                      = 'submit-new-article';
            $data['section_ert']            = SectionErt::where('status', '=', 1)->orderBy('name', 'ASC')->get();
            $data['user_title']             = Title::where('status', '=', 1)->orderBy('name', 'ASC')->get();
            $data['submission_type']        = SubmissionType::where('status', '=', 1)->orderBy('name', 'ASC')->get();
            $data['country']                = Country::orderBy('name', 'ASC')->get();
            $data['pronoun']                = Pronoun::where('status', '=', 1)->orderBy('name', 'ASC')->get();
            $data['ecosystem_affiliation']  = EcosystemAffiliation::where('status', '=', 1)->orderBy('name', 'ASC')->get();
            $data['expertise_area']         = ExpertiseArea::where('status', '=', 1)->orderBy('name', 'ASC')->get();
---
select * from `section_erts` where `status` = 1 order by `name` asc
select * from `titles` where `status` = 1 order by `name` asc
select * from `submission_types` where `status` = 1 order by `name` asc
select * from `countries` order by `name` asc
select * from `pronouns` where `status` = 1 order by `name` asc
select * from `ecosystem_affiliations` where `status` = 1 order by `name` asc
select * from `expertise_areas` where `status` = 1 order by `name` asc