app/Http/Controllers/Admin/ArticlesController.php

    public function viewDetails($id)
    {
        // dd($id);
        $id                             = Helper::decoded($id);
        $data['module']                 = $this->data;
        $title                          = $this->data['title'] . ' View Details';
        $page_name                      = 'article.view_details';
        $data['rows']                   = Article::where('status', '!=', 3)->orderBy('id', 'DESC')->get();
---
select * from `articles` where `status` != 3 order by `id` desc