app/Http/Controllers/Admin/ArticlesController.php

    public function list()
    {
        $data['module']                 = $this->data;
        $title                          = $this->data['title'] . ' List';
        $page_name                      = 'article.list';
        $data['rows']                   = Article::where('status', '!=', 3)->orderBy('id', 'DESC')->get();
---
select * from `articles` where `status` != 3 order by `id` desc

    public function edit(Request $request, $id)
    {
        $data['module']                 = $this->data;
        $id                             = Helper::decoded($id);
        $title                          = $this->data['title'] . ' Update';
        $page_name                      = 'article.add-edit';
        $data['row']                    = Article::where($this->data['primary_key'], '=', $id)->first();
        $data['selected_ecosystem_affiliation'] = json_decode($data['row']->ecosystem_affiliationId);
        $data['selected_expertise_area'] = json_decode($data['row']->expertise_areaId);
        $data['selected_section_ertId'] = json_decode($data['row']->section_ertId);
        $data['section_ert']            = SectionErt::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        $data['user_title']             = Title::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        $data['submission_type']       = SubmissionType::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        // dd($data['submission_types']);
        $data['country']                = Country::orderBy('name', 'ASC')->get();
        // dd($data['country']);
        $data['pronoun']                = Pronoun::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        $data['ecosystem_affiliation']  = EcosystemAffiliation::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        $data['expertise_area']         = ExpertiseArea::where('status', '=', 1)->orderBy('name', 'ASC')->get();
---
select * from `section_erts` where `status` = 1 order by `name` asc
select * from `titles` where `status` = 1 order by `name` asc
select * from `submission_types` where `status` = 1 order by `name` asc
select * from `countries` order by `name` asc
select * from `pronouns` where `status` = 1 order by `name` asc
select * from `ecosystem_affiliations` where `status` = 1 order by `name` asc
select * from `expertise_areas` where `status` = 1 order by `name` asc

                        'bio_long'               => $postData['bio_long'],
                    ];
                    //   Helper::pr($fields);
                    Article::where($this->data['primary_key'], '=', $id)->update($fields);
---
update `articles` set `is_published` = 1, `is_final_edit` = 1, `articles`.`updated_at` = '2024-09-22 14:15:52' where `id` = '11'

    public function viewDetails($id)
    {
        // dd($id);
        $id                                         = Helper::decoded($id);
        $data['module']                             = $this->data;

        $page_name                                  = 'article.view_details';
        $data['row']                                = Article::where('status', '!=', 3)->where('id', '=', $id)->orderBy('id', 'DESC')->first();
        $data['selected_ecosystem_affiliation']     = json_decode($data['row']->ecosystem_affiliationId);
        $data['selected_expertise_area']            = json_decode($data['row']->expertise_areaId);
        $data['selected_section_ertId']             = json_decode($data['row']->section_ertId);
        $data['section_ert']                        = SectionErt::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        $data['user_title']                         = Title::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        $data['submission_type']                    = SubmissionType::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        $data['country']                            = Country::orderBy('name', 'ASC')->get();
        $data['pronoun']                            = Pronoun::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        $data['ecosystem_affiliation']              = EcosystemAffiliation::where('status', '=', 1)->orderBy('name', 'ASC')->get();
        $data['expertise_area']                     = ExpertiseArea::where('status', '=', 1)->orderBy('name', 'ASC')->get();
---
select * from `articles` where `status` != 3 and `id` = '11' order by `id` desc limit 1
select * from `section_erts` where `status` = 1 order by `name` asc
select * from `titles` where `status` = 1 order by `name` asc
select * from `submission_types` where `status` = 1 order by `name` asc
select * from `countries` order by `name` asc
select * from `pronouns` where `status` = 1 order by `name` asc
select * from `ecosystem_affiliations` where `status` = 1 order by `name` asc
select * from `expertise_areas` where `status` = 1 order by `name` asc

    public function generate_nelp_form($id)
    {
        $id                                 = Helper::decoded($id);
        $data['module']                     = $this->data;
        $getArticle                         = Article::where('status', '!=', 3)->where('id', '=', $id)->orderBy('id', 'DESC')->first();
        // Helper::pr($data['row']);
        $article_no                         = (($getArticle)?$getArticle->article_no:'');
        /* generate nelp pdf */
            $generalSetting                 = GeneralSetting::find('1');
---
select * from `articles` where `status` != 3 and `id` = '11' order by `id` desc limit 1
select * from `general_settings` where `general_settings`.`id` = '1' limit 1