app/Http/Controllers/Admin/NewsContentController.php

    public function list()
    {
        $data['module']                 = $this->data;
        $title                          = $this->data['title'] . ' List';
        $page_name                      = 'news_content.list';
        $data['rows']                   = NewsContent::where('status', '!=', 3)->orderBy('id', 'DESC')->get();
---
select * from `news_contents` where `status` != 3 order by `id` desc