app/Http/Controllers/Admin/UserController.php

insert into `user_activities` (`user_email`, `user_name`, `user_type`, `ip_address`, `activity_type`, `activity_details`, `platform_type`) values ('admin@gmail.com', 'Master Admin', 'ADMIN', '::1', 1, 'Login Success !!!', 'WEB')
---
        public function login(Request $request){
            if($request->isMethod('post')){
                $postData = $request->all();
                $rules = [
                            'email'     => 'required|email|max:255',
                            'password'  => 'required|max:30',
                        ];
                if($this->validate($request, $rules)){
                    if(Auth::guard('admin')->attempt(['email' => $postData['email'], 'password' => $postData['password'], 'status' => 1])){
                        // Helper::pr(Auth::guard('admin')->user());put
                        $sessionData = Auth::guard('admin')->user();
                        $request->session()->put('user_id', $sessionData->id);
                        $request->session()->put('name', $sessionData->name);
                        $request->session()->put('type', $sessionData->type);
                        $request->session()->put('email', $sessionData->email);
                        $request->session()->put('is_admin_login', 1);

                        /* user activity */
                            $activityData = [
                                'user_email'        => $sessionData->email,
                                'user_name'         => $sessionData->name,
                                'user_type'         => 'ADMIN',
                                'ip_address'        => $request->ip(),
                                'activity_type'     => 1,
                                'activity_details'  => 'Login Success !!!',
                                'platform_type'     => 'WEB',
                            ];
                            UserActivity::insert($activityData);

insert into `user_activities` (`user_email`, `user_name`, `user_type`, `ip_address`, `activity_type`, `activity_details`, `platform_type`) values ('admin@gmail.com', 'Master Admin', 'ADMIN', '::1', 2, 'You Are Successfully Logged Out !!!', 'WEB')
---
        public function logout(Request $request){
            $user_email                             = $request->session()->get('email');
            $user_name                              = $request->session()->get('name');
            /* user activity */
                $activityData = [
                    'user_email'        => $user_email,
                    'user_name'         => $user_name,
                    'user_type'         => 'ADMIN',
                    'ip_address'        => $request->ip(),
                    'activity_type'     => 2,
                    'activity_details'  => 'You Are Successfully Logged Out !!!',
                    'platform_type'     => 'WEB',
                ];
                UserActivity::insert($activityData);

select count(*) as aggregate from `articles` where `status` != 3 and `is_published` = 0
select count(*) as aggregate from `articles` where `status` != 3 and `is_published` = 1
select count(*) as aggregate from `manuscripts` where `status` = 0
select count(*) as aggregate from `manuscripts` where `status` = 1
select count(*) as aggregate from `manuscripts` where `status` = 2
---
        public function dashboard(){
            $data['current_journal_count']          = Article::where('status', '!=', 3)->where('is_published', '=', 0)->count();
            $data['archieve_journal_count']         = Article::where('status', '!=', 3)->where('is_published', '=', 1)->count();

            $data['pending_manuscript_count']         = Manuscript::where('status', '=', 0)->count();
            $data['active_manuscript_count']         = Manuscript::where('status', '=', 1)->count();
            $data['reject_manuscript_count']         = Manuscript::where('status', '=', 2)->count();